#+TITLE: Emacs config
#+AUTOR: E.M. From
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+STARTUP: overview

Init files for [[id:0a2c2173-fd44-4a65-8ab8-b1306108e82d][emacs]]

[[file:early-init.el][early-init.el]] comes from [[Early init]] section
[[file:desktop.el][desktop.el]] is loaded for EXWM sessions
[[file:init.el][init.el]] is the rest of the file starting with the [[Init][Init]] section


Credit is given throughout the file
 and thanks to all who have forged the way! Onwards into the breach!

**** Configuration

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agoh")))

  ;; Cant find for some reason
  ;;(use-package dired-single)

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired-open
    :config
    ;; Doesn't work as expected!
    ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
    (setq dired-open-extensions '(("png" . "feh")
                                  ("mkv" . "mpv"))))

  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode))

#+end_src

#+RESULTS:
| dired-hide-dotfiles-mode | dired-extra-startup | all-the-icons-dired-mode | doom-modeline-set-project-modeline |

